<?php 
function my_knapsach($w, $n, $wi, $vi)
{
    $k = [[]];
    for ($i = 0 ; $i <= $n ; $i++) {
        for ($j = 0 ; $j <= $w ; $j++) {
            if ($i == 0 || $j == 0) {
                $k[$i][$j] = 0;
            }
            else if (@$wi[$i] <= $w) { // در این بخش در واقع داره برسی میکنه ایا وزن شی کوچکتر مساوی هست با ظرفیت کل کوله
                @$k[$i][$j] = max($k[$i - 1][$j], $k[$i - 1][$w - $wi[$i]]+$vi[$i]); // در این بخش داره یک مقدار جدید برای جدول میسازه میگه بیشترین مقدار رو انتخاب کن از دو مقدار 1)مقدار قبلی یعنی فقط برو روی محصول قبلی و همون موقعیت قبلی  2)و شی قبلی و وزن کل منفی وزن شی فعلی جمع بهش با ارش شی فعلی 
            }else {
                $k[$i][$j] = $k[$i-1][$j]; // در این بخش اگر وزن شی بیشتر از ظرفیت باشه میاد مقدار قبلی شی قبلی و در همان موقیت رو قرار میده
            }
        }
    }
    //return $k[$n][$w];
    return $k;
} 

print_r(my_knapsach(50, 3, [10, 20, 30], [60, 100, 120]));
